Revit 2026 API

# ReferenceContains Method

---

Checks if given reference identifies part of object identified by this reference.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool Contains(
	Reference reference
)
```
```vb
Public Function Contains (
	reference As Reference
) As Boolean
```
```cpp
public:
bool Contains(
	Reference^ reference
)
```
```fsharp
member Contains :
        reference : Reference -> bool
```

#### Parameters

reference Reference
    Another reference.

#### Return Value

BooleanReturns true if given reference identifies part of object identified by this reference, false otherwise.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | Thrown when argument is . |

Can be used to check:

  * If given Reference is a part of a particular Subelement identified by this Reference.
  * If given Reference is a part of a particular Element identified by this Reference.

The input reference can refer to a subelement or a specific geometric item from an element or subelement.

#### Reference

Reference Class

Autodesk.Revit.DB Namespace